In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\asustuf\anaconda3\lib\site-packages (8.0.33)
Collecting protobuf<=3.20.3,>=3.11.0
  Downloading protobuf-3.20.3-cp310-cp310-win_amd64.whl (904 kB)
     -------------------------------------- 904.0/904.0 kB 1.2 MB/s eta 0:00:00
Installing collected packages: protobuf
Successfully installed protobuf-3.20.3

In [28]:
from sqlalchemy import create_engine

In [19]:
import mysql.connector

In [20]:
con = mysql.connector.connect(
    host="localhost",
    user="root",
    password="#Advent777#",
    database="hr"
)

In [21]:
import pandas as pd

In [22]:
cursor = con.cursor() #create a cursor object

In [31]:
query = "Select * from jobs"  #Execute a SQL query

In [32]:
cursor.execute(query)       #Execute a SQL query

In [33]:
result = cursor.fetchall()   # fetch the result

In [34]:
for row in result:    #print the results
    print(row)

('100', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00'))
('200', 'Sr.Software Developer', Decimal('60000.00'), Decimal('80000.00'))
('220', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))
('234', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))
('300', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00'))
('400', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00'))
('500', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00'))
('600', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00'))
('650', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))
('660', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))

In [36]:
df = pd.DataFrame(result)
df.head(10)

     0                      1         2          3
0  100          Sr. Architect  60000.00  100000.00
1  200  Sr.Software Developer  60000.00   80000.00
2  220           Sr. Designer  70000.00   90000.00
3  234           Sr. Designer  70000.00   90000.00
4  300  Jr.Software Developer  40000.00   60000.00
5  400  Jr.Software Developer  40000.00   60000.00
6  500          Jr. Architect  50000.00   70000.00
7  600         Lead Architect  70000.00  100000.00
8  650           Jr. Designer  60000.00   70000.00
9  660           Jr. Designer  60000.00   70000.00